# -*- coding:utf-8 -*-
__author__ = 'Yuriy'

'''
6–16.矩阵.处理矩阵 M 和 N 的加和乘操作.
'''
# a)两个矩阵的维数相等才能相加
a = ([1, 2, 3], [4, 5, 6], [7, 8, 9])
b = ([9, 8, 7], [6, 5, 4], [3, 2, 1])

c = ([0, 0, 0], [0, 0, 0], [0, 0, 0])
for i in range(0, len(a)):
	for j in range(0, len(b)):
		c[i][j] = a[i][j] + b[i][j]
print c

# b)矩阵1的列数与矩阵2的行数相等两个矩阵才能相乘
a = ([1, 2, 3, 4], [5, 6, 5, 8], [9, 10, 11, 12])
b = ([1, 1, 1], [1, 1, 1], [1, 1, 1], [1, 1, 1])

c = ([0, 0, 0], [0, 0, 0], [0, 0, 0])
for m in range(0, len(c)):
	for i in range(0, len(a)):
		for j in range(0, len(b)):
			c[m][i] += a[i][j] * b[j][i]
print c