__author__ = 'Yuriy'
# coding:utf-8

'''
营业税税率

　　营业税税率按照行业、类别不同分别采用了不同的比例税率。交通运输业为3％，出售、出租无形资产为5％，销售不动产为5％。

营业税的计算和核算

　　外贸企业提供代理业务、运输业务、出租无形资产业务发生的营业税列入“其他业务支出”账户；
    支付出售无形资产业务发生的营业税列入“营业外收入”账户；支付出售不动产业务发生的营业税则列入“固定资产清理”账户。
    营业税的计算公式如下：
		应纳营业税额=计税营业额×营业税税率

「例」武泰钢材进出口公司3月份发生代理出口销售手续费收入16 000元，出租专利权租金收入10 000元，出售旧仓库收入200 000元，营业税税率为5％。
	计算本月份应纳营业税额如下：

　　代理业务应纳营业税额=16 000×5％=800（元）

　　出租专利权应纳营业税额=10 000×5％=500（元）

　　出售旧仓库应纳营业税额=200 000×5％=10 000（元）

　　根据计算的结果，提取应纳营业税额，作分录如下：

　　借：其他业务支出——代理业务　800

　　　　其他业务支出——出租无形资产　500

　　　　固定资产清理——出售旧仓库　10 000

　　贷：应交税金——应交营业税　11 300
'''

'''
这样感觉挺简单的了、、只不过地区的营业税税率还难查、、、
'''